<?php 
function DeterminePrefixSufix ($word, $pos, $strong) {

	$output_word = '';
	//prefix and suffixes

$ppp = array('ב֞','לִ֞','ל֡','בָ֨','ל֕','לִּ֕','בָּ֜','מֵ֣','לִּ֨','ב֤','בַּ֣','וִ֣','לִ֗','בָ֤','וִ֠','לּ֜','לּ֧','וַ֥','בִּ֛','לִ֕','הֲ֠','לָּ֧','וָ֠','הֶ֨','בִ֣','בְ֠','כַ֣','בִ֨','וּ','וַֽ֠','מִ֨','בָּ֤','בָ֥','בִּ֗','ב֣','לָּ֤','לָ֤ׄ','בָּ֠','בְּ֠','הֶ֣','בָ֗','ב֗','בּ֤','ב֜','בָּ֛','ב֥','לִ֠','לָ֠','בִּ֖','וְֽ֠','לָ֦','וַ֣','לַ֠','לִּ֜','בִּ֑','בִ֔','בָּ֥','בּ֗','לָּ֥','בָ֜','בָ֛','כְּ֠','בִ֑','הָ֨','כַּ֠','בִּ֠','בַּ֠','בּ֛','לַ֨','ל֧','לּ֑','בָּ֗','ב֛','לּ֣','הַ֠','לּ֛','בָ֖','לּ֛','לּ֗','בַ֨','בָּ֔','מִ֠','בּ֜','בָ֑','בָּ֖','ב', 'בְ', 'בְֽ', 'בִ', 'בִֽ', 'בֵ', 'בֵֽ', 'בֶ', 'בֶֽ', 'בַ', 'בַֽ', 'בָ', 'בָֽ', 'בּ', 'בְּ', 'בְּֽ', 'בִּ', 'בִּֽ', 'בֵּ', 'בֵּֽ', 'בֶּ', 'בֶּֽ', 'בַּ', 'בַּֽ', 'בָּ', 'בָּֽ', 'בּֽ', 'בַּֽ', 'בָּֽ', 'בֽ', 'בָֽ', 'ה', 'הְֽ', 'הֲ', 'הֳ', 'הֶ', 'הֶֽ', 'הַ', 'הַֽ', 'הַׄ', 'הָ', 'הָֽ', 'הֶֽ', 'הַֽ', 'הָֽ', 'הְֽ', 'הֲ', 'הֲֽ', 'הֶ', 'הֶֽ', 'הַ', 'הַֽ', 'הֲֽ', 'הַֽ', 'הָֽ', 'הֲ‍ֽ', 'ו', 'וְ', 'וְֽ', 'וְׄ', 'וֲ', 'וִ', 'וִֽ', 'וֵ', 'וֵֽ', 'וֶ', 'וֶֽ', 'וַ', 'וַֽ', 'וַׄ', 'וָ', 'וָֽ', 'וּ', 'וִּ', 'וּֽ', 'וּׄ', 'וְֽ', 'וִֽ', 'וֵֽ', 'וֶֽ', 'וַֽ', 'וָֽ', 'כ', 'כְ', 'כִ', 'כֶ', 'כַ', 'כַֽ', 'כָ', 'כְּ', 'כְּֽ', 'כִּ', 'כִּֽ', 'כֵּ', 'כֵּֽ', 'כֶּ', 'כֶּֽ', 'כַּ', 'כַּֽ', 'כָּ', 'כָּֽ', 'כַּֽ', 'כָּֽ', 'ל', 'לְ', 'לְֽ', 'לְׄ', 'לֲ', 'לִ', 'לִֽ', 'לֵ', 'לֵֽ', 'לֶ', 'לֶֽ', 'לַ', 'לַֽ', 'לָ', 'לָֽ', 'לָׄ', 'לּ', 'לְּ', 'לִּ', 'לִּֽ', 'לֵּ', 'לֶּ', 'לַּ', 'לָּ', 'לָּֽ', 'לּֽ', 'לֽ', 'לְֽ', 'לִֽ', 'לֵֽ', 'לֶֽ', 'לַֽ', 'לָֽ', 'לִֽֿ', 'מ', 'מְ', 'מִ', 'מִֽ', 'מֵ', 'מֵֽ', 'מֶ', 'מֶֽ', 'מַ', 'מִּ', 'מֵּ', 'מֵֽ', 'ש', 'שְׁ', 'שֶׁ', 'שֶֽׁ', 'שַׁ', 'שָׁ', 'שֶּׁ', 'שֶּֽׁ', 'ב֖', 'בּ֥', 'לּ֥', 'הָ֠', 'הָֽ', 'הָ֣', 'בּ֑', 'ל֖', 'לִּ֥', 'לָ֑', 'לָ֚', 'לָ֔', 'לָ֖', 'וּ֠', 'הַ֨', 'בּ֖', 'בַ֣', 'וְ֠', 'מֵ֠', 'הַ֣', 'לָּ֣','לָּ֖', 'לִ֣', 'ל֤', 'לִּ֑', 'לִּ֔', 'לִ֖', 'ל֛', 'ל֣', 'וַ֠','ל֥', 'לִ֔', 'ל֔', 'לּ֖','לָ֧', 'ל֑','לָ֛', 'לְ֠', 'לָּ֔','ב֔', 'לִּ֣', 'לָ֣', 'בָּ֣', 'לִ֜', 'ל֗', 'לִ֑', 'ל֜', 'לָּ֨', 'לָ֜', 'לִּ֗', 'לִּ֤', 'בִּ֥','לִ֤', 'לִ֛', 'בָ֣', 'לָ֤','ל֞','לָ֥','לָ֗', 'לָּ֑', 'כִּ֠','לָ','וְ֭','בַּ֝','בְּ֭','בְּ֝','מִֽ֝','וְ֝','וּ֝','לְ֝','וּ֭','לִּ֖','לּ֔','לִ֨','לִ֥','ל֦','בִּ֤','בִּ֔','לִּ֛','לִּ֞','מִ֝','בְ֭','וַֽ֝','בִּ֭','וְֽ֭','וַ֝','וִֽ֭','וַ֭','לִֽ֝','מֵ֝','לָ֨','ל֨','בּ֣','ב֑','לָּ֛','בָּ֑','בָּ֨','בָ֔','בּ֔','וִ֥','הַֽ֠');

$sss = array('נוּ֩','הְנָה','נָּה֙','נִ֕י','הֶ֡ם','י֩','הֶ֞ם','הּ֮','הֶם֮','הָ֒','הֶ֨ם','ה֮','ן','הּ֩','נ֣וּ','מוֹ֙','דִ֑י','נְהוּ֙','נׄוּׄ֙','נׄוּׄ','הֵ֖ן','ךָ֡','כֶּ֔ם','ךָ֧','ן֮','כֶ֕ם','כֶ֧ם','ו֒','נוּ֮','ךָ֞','הֵ֑ן','כֶם֮','כֶ֞ם','הּ֒','כֶם֒','וֹ֩','ן֙','ן','ם֒','ם֮','נִ֧י','נָּה֮','הֶם֒','יַ','נִ֣י','נִ֨י','מוֹ','נְהוּ','הֶ֜ם','כָ֔ה','נּוּ','ן֙','כֶן֙','נּוּ','נּֽוּ','נִ֤י','הֶם֩','הֶ֥ם','כֶם֩','נּוּ֙', 'ן', 'הֶ֣ם','ן','נּוּ֩','כֶ֔ן','נָּה','א', 'אָה', 'דִי', 'ה', 'הָ', 'הּ', 'הָּ', 'הֿ', 'הָא', 'הא', 'הֽוּ', 'הׄוּׄ', 'הו', 'הוּ', 'הוא', 'הוֹם', 'הֽוֹן', 'הוֹן', 'הון', 'הִי', 'הֵין', 'הֶֽם', 'הֶם', 'הַם', 'הֹֽם', 'הֹם', 'הֶּם', 'הֶֽם', 'הם', 'הֵמָה', 'הֵן', 'הֶֽן', 'הֶן', 'הְנָה', 'הֶֽנָה', 'ו', 'וֹ', 'וּ', 'וׄ', 'וּהִי', 'וּךְ', 'י', 'יַ', 'ידע', 'יָהּ', 'יהָ', 'יהֶם', 'יו', 'יונים', 'יךְ', 'ינה', 'ך', 'ךְ', 'ךָ', 'ךָֽ', 'ךָּ', 'כֵה', 'כָה', 'כָּה', 'כוֹן', 'כִי', 'כי', 'כֶֽם', 'כֶם', 'כֹם', 'כם', 'כֶֽן', 'כֶן', 'כֶֽנָה', 'כֶנָה', 'ם', 'מו', 'מוֹ', 'מוּ', 'ן', 'נ', 'נְ', 'נֶ', 'נַ', 'נָא', 'נא', 'נָה', 'נָּֽה', 'נָּה', 'נה', 'נְהֽוּ', 'נְהוּ', 'נּֽוּ', 'נּוּ', 'נׄוּׄ', 'נו', 'נוֹ', 'נוּ', 'נִֽי', 'נִי', 'נִּי', 'ני', 'נְךָּ', 'נְנִי','הוּ', 'הֶ֗ם', 'כֶ֥ם','כֶ֜ם', 'ךָ֥', 'הֶם֙', 'כֶ֣ם', 'כֶ֑ם', 'הֶ֔ם', 'הֶ֖ם', 'ךָ֔', 'ךָ֣', 'ךָ֙', 'ךָ֖', 'ךְ֙', 'ךָ֒', 'הֶ֑ן', 'ם֙', 'נוּ֙', 'הֶ֑ם', 'נִ֥י', 'נִי֩', 'וֹ֙', 'ךָ֗', 'ךָ֛', 'הֶ֛ם', 'כֶ֤ם', 'כֶם֙', 'כֶ֖ם', 'י֙', 'כֶ֔ם', 'כָ֥ה', 'כָ֞ה', 'ו֙', 'הֶ֤ם', 'וְ', 'הּ֙', 'כָ֖ה', 'הֶ֧ם','וֹ֒', 'ךָ֨', 'כֶ֛ם', 'הָ֙','ךָ֤', 'ךָ֜', 'ה֙', 'הֶ֔ן', 'הֶ֛ן', 'הֶ֖ן', 'כֶ֗ם','י֮','י֒','כֶ֨ם','הֶן֙','ךְ֒','נִי֙','כָ֛ה','כָ֣ה','הוּ֙','ו֮','הֶ֗ן','וֹ֮','ךָ֮','ךָ֩');


	//if there's only 1 prefix or suffix, determine if it's prefix or suffix then print out the verse
	if (substr_count($word, '/') == 1) {

		$prepre = strtok($word, '/');
		$sufsuf = substr(strrchr($word, '/'), 1);

		if (in_array($prepre, $ppp)) {
			$output_word = $prepre.'<span class="'.$pos.'"><a href="HebrewStrong.php?id='.$strong.'">'.$sufsuf.'</a></span> ';
		}
		else {
			$output_word = '<span class="'.$pos.'"><a href="HebrewStrong.php?id='.$strong.'">'.$prepre.'</a></span>'.$sufsuf.' ';
		}
	}

	//if there are 2 prefix or suffix, that means there's a prefix / word / suffix, print out accordingly in order
	elseif (substr_count($word, '/') == 2) {

		$prepre = strtok($word, '/');

		if (in_array($prepre, $ppp)) {
			
			$trimmed_word = substr($word, strpos($word, "/") + 1);
			$sufsuf = DeterminePrefixSufix($trimmed_word, $pos, $strong);
			$output_word = $prepre.$sufsuf;

		}
		else {

			$firstpart = DeterminePrefixSufix($prepre, $pos, $strong);
			$trimmed_word = substr($word, strpos($word, "/") + 1);
			$sufsuf = DeterminePrefixSufix($prepre, $pos, $strong);
			$output_word = $firstpart.$sufsuf;		

		}
	}

	//if there are more than 2 prefix or suffix, then repeat this function
	elseif (substr_count($word, '/') > 2) {

		$prepre = strtok($word, '/');
		$trimmed_word = substr($word, strpos($word, "/") + 1);
		$sufsuf = DeterminePrefixSufix($trimmed_word, $pos, $strong);
		$output_word = $prepre.$sufsuf;

	}

	//return the bible verse print out
	return $output_word;
}
?>